0.57.2119-1/Catalogs/ККСНГ_Квитанции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ККСНГ_Квитанции</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ККСНГ_ЭлектронныеДокументы</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Id</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DocumentId</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Uuid</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ParentUuid</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Direction</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Type</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExtendedType</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Date</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>NeedReply</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ККСНГ_ExtendedDocumentType</Name>
					<Comment>Расширенный тип документа</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ККСНГ_ExtendedDocumentType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Подписи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Uuid</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>32</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Content</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>SignerCode</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>46</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПодписи</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

0.57.2119-1/Catalogs/ККСНГ_Организации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ККСНГ_Организации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодУчастникаЭДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>47</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСК</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючДоступаAPI</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПодпискиСК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантНастройкиОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ККСНГ_ЗначенияСвойствОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособАвторизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ККСНГ_СпособыАвторизацииКурьер</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МногопользовательскийРежим</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодключаемыйМодуль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИОбработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбработчикПослеФормированияЭД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИОбработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОтправкиМЧД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СпособАвторизации</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ККСНГ_СпособыАвторизацииКурьер</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь1С</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючДоступаAPI</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

0.57.2119-1/Catalogs/ККСНГ_СертификатыКлючейЭлектроннойПодписи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ККСНГ_СертификатыКлючейЭлектроннойПодписи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Begin</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>End</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Image</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Inn</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ogrn</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Organization</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Title</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписант</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

0.57.2119-1/CommonModules/ККСНГ_ОбщегоНазначенияВызовСервера/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Сбрасывает размеры и положение окна формы
//
// Параметры:
//  Форма - УправляемаяФорма - форма, из обработчика события которой происходит вызов процедуры
//
Процедура СброситьРазмерыИПоложениеОкна(Форма) Экспорт

	ИмяПользователя = ПользователиИнформационнойБазы.ТекущийПользователь().Имя;
	Если ПравоДоступа("СохранениеДанныхПользователя", Метаданные) Тогда
		ХранилищеСистемныхНастроек.Удалить(Форма.ИмяФормы, "", ИмяПользователя);
	КонецЕсли;

	Форма.КлючСохраненияПоложенияОкна = Строка(Новый УникальныйИдентификатор);

КонецПроцедуры

#Область ЭлектронныеПодписи

// Возвращает массив данных ЭП для объекта
//
// Параметры:
//	ОбъектЭДО                 - Справочник.ККСНГ_ЭлектронныеДокументы или ККСНГ_Квитанции
//	ТипТранспортногоДокумента - тип документа
//
// Возвращаемое значение:
//	Массив элементов см.ПолучитьСтруктуруОписанияЭлектроннойПодписи()
//
Функция ПолучитьМассивЭПОбъектаЭДО(ОбъектЭДО, ТипТранспортногоДокумента) Экспорт 
	
	ТипЗнчОбъекта = ТипЗнч(ОбъектЭДО);
	Если ТипЗнчОбъекта = Тип("СправочникСсылка.ККСНГ_ЭлектронныеДокументы") Тогда
		МассивЭП = ПолучитьМассивЭПЭлектронногоДокумента(ОбъектЭДО, ТипТранспортногоДокумента);
	ИначеЕсли ТипЗнчОбъекта = Тип("СправочникСсылка.ККСНГ_Квитанции") Тогда
		МассивЭП = ПолучитьМассивЭПКвитанции(ОбъектЭДО);
	Иначе
		МассивЭП = Новый Массив;	
	КонецЕсли;
	
	Возврат МассивЭП;
	
КонецФункции

// Возвращает массив данных ЭП для ЭД
//
// Параметры:
//	ЭлектронныйДокумент       - Справочник.ККСНГ_ЭлектронныеДокументы
//	ТипТранспортногоДокумента - тип документа
//
// Возвращаемое значение:
//	Массив элементов см.ПолучитьСтруктуруОписанияЭлектроннойПодписи()
//
Функция ПолучитьМассивЭПЭлектронногоДокумента(ЭлектронныйДокумент, ТипТранспортногоДокумента) Экспорт
	
	// если основной документ и требуются подписи двух сторон
	Если ТребуютсяПодписиДвухСторон(ТипТранспортногоДокумента) Тогда
		МассивЭП = ПолучитьЭлектронныеПодписиПродавцаПокупателя(ЭлектронныйДокумент);
	Иначе		
		МассивЭП = ПолучитьЭлектронныеПодписиДокумента(ЭлектронныйДокумент);
	КонецЕсли;
	
	Возврат МассивЭП;
	
КонецФункции

// Возвращает массив данных ЭП для квитанции
//
// Параметры:
//	Квитанция       - Справочник.ККСНГ_Квитанции
//
// Возвращаемое значение:
//	Массив элементов см.ПолучитьСтруктуруОписанияЭлектроннойПодписи()
//
Функция ПолучитьМассивЭПКвитанции(Квитанция) Экспорт
	
	// проверить возможность работы с менеджером криптографии
	ДоступенМенеджерКриптографии = ДоступенМенеджерКриптографииНаСервере();
	
	МассивЭП = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ККСНГ_КвитанцииПодписи.ДатаПодписи КАК ДатаПодписи,
	|	ККСНГ_КвитанцииПодписи.Content КАК Подпись	
	|ИЗ
	|	Справочник.ККСНГ_Квитанции.Подписи КАК ККСНГ_КвитанцииПодписи
	|ГДЕ
	|	ККСНГ_КвитанцииПодписи.Ссылка = &Квитанция";
	Запрос.УстановитьПараметр("Квитанция", Квитанция);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтруктураЭП = ЗаполнитьСтруктуруОписанияЭлектроннойПодписи(Выборка, ДоступенМенеджерКриптографии, Ложь);		
		МассивЭП.Добавить(СтруктураЭП);	
	КонецЦикла; 
	
	Возврат МассивЭП;	
	
КонецФункции

#КонецОбласти 

// Возвращает текущую дату сервера, приведенную к часовому поясу сеанса.
//
// Параметры:
//	нет
//
// Возвращаемое значение:
//  Дата - текущая дата сервера, приведенная к часовому поясу сеанса.
//
Функция ТекущаяДатаВремяСеанса() Экспорт
	
	Возврат ТекущаяДатаСеанса() ;
		
КонецФункции

// Получает версию указанной подсистемы
Функция ПолучитьВерсиюПодсистемы(ИдентификаторПодсистемы) Экспорт
	
	Перем ВерсияПодсистемы, МодульОбновлениеИнформационнойБазы;
	
	МодульОбновлениеИнформационнойБазы = ККСНГ_ОбщегоНазначенияКлиентСервер.ОбщийМодуль("ОбновлениеИнформационнойБазы");
	
	УстановитьПривилегированныйРежим(Истина);
	ВерсияПодсистемы = МодульОбновлениеИнформационнойБазы.ВерсияИБ(ИдентификаторПодсистемы);
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ВерсияПодсистемы;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ФоновыеЗадания 

// Добавляет фоновое задание в очередь на выполнение и возвращает идентификатор добавленного задания
//
// Параметры:
//   ИмяМетода - Строка - Полное имя экспортного метода неглобального общего модуля
//   ПараметрыВызова - Массив - Параметры обработчика
//   КлючЗадания - Строка - Ключ задания
//   Описание - Строка - Описание задания
//
// Возвращаемое значение:
//   ИдентификаторЗадания - Строка - Идентификатор фонового задания
//   
// Пример:
//   ПараметрыЗапроса = Новый Массив();
//	 ПараметрыЗапроса.Добавить(ДанныеФормированияЗапросовРазделов);
//	 ПараметрыЗапроса.Добавить(АдресХранилищаРезультата);
//
//   ВыполнитьФоновоеЗадание("ККСНГ_ЭлектронныеДокументы.ПолучитьЗначенияСчетчиковРазделов", ПараметрыЗапроса)
//
Функция ВыполнитьФоновоеЗадание(ИмяМетода, ПараметрыВызова = Неопределено, КлючЗадания = Неопределено, Описание = "") Экспорт
	
	Попытка
		ФоновоеЗадание = ФоновыеЗадания.Выполнить(ИмяМетода, ПараметрыВызова, КлючЗадания, Описание);
		ИдентификаторЗадания = ФоновоеЗадание.УникальныйИдентификатор;
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		ИдентификаторЗадания = Неопределено;
	КонецПопытки;
	
	Возврат ИдентификаторЗадания;
	
КонецФункции

// Проверяет состояние фонового задания по переданному идентификатору.
// Если фоновое задание не найдено, то оно считатется выполненным.
//
// Параметры:
//  ИдентификаторЗадания - УникальныйИдентификатор, Строка - идентификатор фонового задания. 
//  ТекстОшибки       - Строка - описание ошибки при выполнении фз
//
// Возвращаемое значение:
//  Булево - состояние выполнения задания.
// 
Функция ЗаданиеВыполнено(idЗадания, ТекстОшибки = Неопределено) Экспорт

	ЗаданиеВыполнено = Истина;
	
	ФоновоеЗадание = НайтиЗаданиеПоИдентификатору(idЗадания);
	
	Если ФоновоеЗадание <> Неопределено Тогда
		
		Если ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
			ЗаданиеВыполнено = Ложь;
			ОписаниеОшибки = "";
		ИначеЕсли ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
			ПредставлениеОшибки = ПодробноеПредставлениеОшибки(ФоновоеЗадание.ИнформацияОбОшибке);
			ОписаниеОшибки = "Фоновое задание завершилось аварийно. " + ?(ЗначениеЗаполнено(ПредставлениеОшибки), ПредставлениеОшибки, "");
		ИначеЕсли ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.Отменено Тогда
			ОписаниеОшибки = "Фоновое задание отменено администратором.";
		Иначе
			ОписаниеОшибки = "";
		КонецЕсли;
	
		Если НЕ ТекстОшибки = Неопределено Тогда
			ТекстОшибки = ОписаниеОшибки;
		КонецЕсли;
	
	КонецЕсли;
	
	Возврат ЗаданиеВыполнено;
	
КонецФункции

// Поиск фонового задания по переданному идентификатору.
//
// Параметры:
//  ИдентификаторЗадания - УникальныйИдентификатор, Строка - идентификатор фонового задания. 
//
// Возвращаемое значение:
//  ФоновоеЗадание, Неопределено - Если задание для заданного идентификатора не найдено, возвращает Неопределено.
//
Функция НайтиЗаданиеПоИдентификатору(Знач ИдентификаторЗадания) Экспорт
	
	Если ТипЗнч(ИдентификаторЗадания) = Тип("Строка") Тогда
		ИдентификаторЗадания = Новый УникальныйИдентификатор(ИдентификаторЗадания);
	КонецЕсли;
		
	Возврат ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторЗадания);
	
КонецФункции

// Возвращает состояние ФЗ по id
//
// Параметры:
//	ИдентификаторЗадания       - id ФЗ
//	УдалятьСообщения           - Булево
//
// Возвращаемое значение:
//	Структура
//   * Завершено      - Булево 
//   * ОписаниеОшибки - Строка
//
Функция РезультатВыполненияФоновогоЗадания(ИдентификаторЗадания, УдалятьСообщения = Ложь) Экспорт
	
	РезультатВыполнения = Новый Структура("Завершено, ОписаниеОшибки", Истина);
	
	УстановитьПривилегированныйРежим(Истина);

	ФоновоеЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(Новый УникальныйИдентификатор(ИдентификаторЗадания));	
	Если ФоновоеЗадание = Неопределено Тогда
		Возврат РезультатВыполнения;
	КонецЕсли;
	
	РезультатВыполнения.Завершено = ФоновоеЗадание.Состояние <> СостояниеФоновогоЗадания.Активно;
	Если РезультатВыполнения.Завершено Тогда
		ОшибкаЗадания = ФоновоеЗадание.ИнформацияОбОшибке;
		Если ОшибкаЗадания <> Неопределено Тогда
			РезультатВыполнения.ОписаниеОшибки = ПодробноеПредставлениеОшибки(ОшибкаЗадания);
		КонецЕсли;
		Если УдалятьСообщения Тогда
			ФоновоеЗадание.ПолучитьСообщенияПользователю(Истина);
		КонецЕсли;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);

	Возврат РезультатВыполнения;

КонецФункции

// Возвращает состояние ФЗ по id
//
// Параметры:
//	ИдентификаторЗадания       - id ФЗ
//	ШаблонФорматирования       - Строка вида "; получателю; ; получателям; получателям; получателям", см. справку СтрокаСЧислом
//
// Возвращаемое значение:
//	Структура
//   * Процент       - Число   - процент выполнения фз
//   * Количество    - Число   - число обработанных пакетов фз
//   * Представление - Строка  - представление числа по произвольному шаблону, пример: "3 получателям"
//
Функция ИнфоОВыполненииФоновогоЗадания(ИдентификаторЗадания, ШаблонФорматирования) Экспорт

	ИнфоОВыполнении = ДлительныеОперации.ПрочитатьПрогресс(ИдентификаторЗадания);
	
	Если НЕ ИнфоОВыполнении = Неопределено Тогда
		
		Результат = Новый Структура;
		Результат.Вставить("Процент", ИнфоОВыполнении.Процент);
		Результат.Вставить("Количество", ИнфоОВыполнении.ДополнительныеПараметры);
		Результат.Вставить("Представление",  СтрокаСЧисломПоШаблону(ШаблонФорматирования, ИнфоОВыполнении.ДополнительныеПараметры));
		
		Возврат Результат;
		
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Возвращает представление числа по произвольному шаблону, пример: "3 получателям"
//
// Параметры:
//	ШаблонФорматирования - Строка вида "; получателю; ; получателям; получателям; получателям", см. справку СтрокаСЧислом
//	Количество           - Число
//
// Возвращаемое значение:
//	Строка
//
Функция КоличествоСтрокой(ШаблонФорматирования, Количество) Экспорт

	Окончание = СтрокаСЧислом(ШаблонФорматирования, Количество, ВидЧисловогоЗначения.Количественное, "L=ru");
	
	Результат = "" + Количество + " " + Окончание;
	
	Возврат Результат;

КонецФункции

#КонецОбласти

#Область RLS

// Возвращает доступные профили ЭДО для пользователя
//
// Параметры:
//	нет
//
// Возвращаемое значение:
//	массив элементов типа Справочник.ККСНГ_Организации
//
Функция ПолучитьДоступныеПрофилиЭДОПользователя() Экспорт 
			
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Организации.Ссылка КАК Организация
	               |ПОМЕСТИТЬ ВТ_ДоступныеОрганизации
	               |ИЗ
	               |	Справочник.Организации КАК Организации
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Организация
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ККСНГ_Организации.Ссылка КАК ПрофильЭДО
	               |ИЗ
	               |	Справочник.ККСНГ_Организации КАК ККСНГ_Организации
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДоступныеОрганизации КАК ВТ_ДоступныеОрганизации
	               |		ПО (ВТ_ДоступныеОрганизации.Организация = ККСНГ_Организации.Организация)";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ПрофильЭДО");
		
КонецФункции

// Возвращает доступные организации для пользователя
//
// Параметры:
//	нет
//
// Возвращаемое значение:
//	массив элементов типа Справочник.Организации
//
Функция ПолучитьДоступныеОрганизацииПользователя() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Организации.Ссылка КАК Организация
	               |ИЗ
	               |	Справочник.Организации КАК Организации";
				    	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Организация");
	
КонецФункции	

// Проверяет доступность профиля для пользователя
//
// Параметры:
//	ПрофильЭДО - Справочник.ККСНГ_Организации
//
// Возвращаемое значение:
//	Булево
//
Функция ПрофильЭДОДоступенПользователю(ПрофильЭДО) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	               |	ККСНГ_Организации.Организация.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ККСНГ_Организации КАК ККСНГ_Организации
	               |ГДЕ
	               |	ККСНГ_Организации.Ссылка = &Ссылка
	               |	И НЕ ККСНГ_Организации.Организация.Ссылка ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("Ссылка", ПрофильЭДО);
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

// Проверяет доступность организации для пользователя
//
// Параметры:
//	Организация - Справочник.Организации
//
// Возвращаемое значение:
//	Булево
//
Функция ОрганизацияДоступнаПользователю(Организация) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	               |	Организации.Ссылка КАК Организация
	               |ИЗ
	               |	Справочник.Организации КАК Организации
	               |ГДЕ
	               |	Организации.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Организация);
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

// Функция Получает реквизиты оранизации
//
// Параметры:
//  Организация - Справочник.ККСНГ_Организации
// 
// Возвращаемое значение: Структура
//   - 
//
Функция ПолучитьДанныеПоОрганизации(Организация) Экспорт
	
	Перем СтруктураДанныхОрганизации;
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета("Получение данных по организациям");
	
	РеквизитыОрганизаций = Метаданные.Справочники.Организации.Реквизиты;
	
	Если РеквизитыОрганизаций.Найти("РегистрацияВНалоговомОргане") <> Неопределено Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Организации.Ссылка КАК Ссылка,
		|	Организации.Наименование КАК Наименование,
		|	Организации.ИНН КАК ИНН,
		|	Организации.ОГРН КАК ОГРН,
		|	ВЫБОР
		|		КОГДА Организации.РегистрацияВНалоговомОргане.КПП ЕСТЬ NULL
		|			ТОГДА ЕСТЬNULL(Организации.КПП, НЕОПРЕДЕЛЕНО)
		|		ИНАЧЕ ЕСТЬNULL(Организации.РегистрацияВНалоговомОргане.КПП, НЕОПРЕДЕЛЕНО)
		|	КОНЕЦ КАК КПП
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.Ссылка = &Организация";
		
	ИначеЕсли РеквизитыОрганизаций.Найти("КПП") <> Неопределено Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Организации.Ссылка КАК Ссылка,
		|	Организации.Наименование КАК Наименование,
		|	Организации.ИНН КАК ИНН,
		|	Организации.ОГРН КАК ОГРН,
		|	Организации.КПП КАК КПП
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.Ссылка = &Организация";
		
	Иначе
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Попытка
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаРезультата = РезультатЗапроса.Выбрать();
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, "Ошибка получение данных организации", "CFG-00011", ОписаниеОшибки);
		
		Возврат Ответ;
	КонецПопытки;
	
	Пока ВыборкаРезультата.Следующий() Цикл
		СтруктураДанныхОрганизации = Новый Структура;
		
		Для каждого Колонка Из РезультатЗапроса.Колонки Цикл
			СтруктураДанныхОрганизации.Вставить(Колонка.Имя, ВыборкаРезультата[Колонка.Имя]);
		КонецЦикла;
		
		Ответ.Результат = СтруктураДанныхОрганизации;
		
	КонецЦикла;
	
	Ответ.Успех = Истина;
	
	Возврат Ответ;
	
КонецФункции

#КонецОбласти

// Проверяет доступность по коду типа ЭД
//
// Параметры:
//	КодТипаЭД - Строка
//
// Возвращаемое значение:
//	Булево
//
Функция ДоступнаВыгрузкаФНС(КодТипаЭД) Экспорт
	
	КодыТиповСВыгрузкойФНС = Новый Массив;
	КодыТиповСВыгрузкойФНС.Добавить("ACTFNS");
	КодыТиповСВыгрузкойФНС.Добавить("CSF");
	КодыТиповСВыгрузкойФНС.Добавить("SF");
	КодыТиповСВыгрузкойФНС.Добавить("WAYBILL");
	КодыТиповСВыгрузкойФНС.Добавить("UPD_DOP");
	КодыТиповСВыгрузкойФНС.Добавить("UPD_SF");
	КодыТиповСВыгрузкойФНС.Добавить("UPD_SF_DOP");
	КодыТиповСВыгрузкойФНС.Добавить("UCD_CSF");
	КодыТиповСВыгрузкойФНС.Добавить("UCD_CSF_DIC");
	КодыТиповСВыгрузкойФНС.Добавить("UCD_DIC");	
	КодыТиповСВыгрузкойФНС.Добавить("TOVTORG");
	КодыТиповСВыгрузкойФНС.Добавить("REZRU");
	
	Возврат КодыТиповСВыгрузкойФНС.Найти(КодТипаЭД) <> Неопределено;
		
КонецФункции // ДоступнаВыгрузкаФНС()

// Возвращает данные подписи
//
// Параметры:
//	Подпись - Содержимое контейнера с подписью
//
// Возвращаемое значение:
//  Неопределено или Структура:
// 		* КомуВыданСертификат - Строка
// 		* Отпечаток           - Строка
// 		* СрокДействия        - Строка
// 		* ИздательСертификата - Строка
Функция ПрочитатьДанныеПодписиНаСервере(Подпись) Экспорт
	
	Результат = Неопределено;
	
	МенеджерКриптографии = ЭлектроннаяПодпись.МенеджерКриптографии("ПолучениеСертификатов", Ложь);	
	
	Если МенеджерКриптографии = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Попытка
		Сертификаты = МенеджерКриптографии.ПолучитьСертификатыИзПодписи(Подпись);
	Исключение
		Возврат Результат;
	КонецПопытки;
	
	Если Сертификаты.Количество() > 0 Тогда
		Сертификат = Сертификаты[0];
		
		Результат = Новый Структура;
		Результат.Вставить("КомуВыданСертификат", ККСНГ_ЭлектроннаяПодписьКлиентСервер.ПредставлениеСубъекта(Сертификат));
		Результат.Вставить("Отпечаток", СтрЗаменить(Строка(Сертификат.Отпечаток), " ", ""));
		Результат.Вставить("СрокДействия", ККСНГ_ЭлектроннаяПодписьКлиентСервер.СрокДействияСертификатаСтрокой(Сертификат.ДатаНачала, Сертификат.ДатаОкончания));
		Результат.Вставить("ИздательСертификата", ККСНГ_ЭлектроннаяПодписьКлиентСервер.ПредставлениеИздателя(Сертификат));		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Кодирует строку в соответствии с выбранным способом кодирования.
//
// Параметры:
//	НекаяСтрока       - Строка
//	СпособКодирования - Строка
//
// Возвращаемое значение:
//	Строка
//
Функция ВыполнитьКодировкуСтроки(НекаяСтрока, СпособКодирования = "КодировкаURL") Экспорт
	
	Если СпособКодирования = "КодировкаURL" Тогда
		Возврат КодироватьСтроку(НекаяСтрока, СпособКодированияСтроки.КодировкаURL);
	Иначе
		Возврат КодироватьСтроку(НекаяСтрока, СпособКодированияСтроки.URLВКодировкеURL);
	КонецЕсли; 
	
КонецФункции // ВыполнитьКодировкуСтроки

// Возвращает ссылку на объект по его UID
//
// Параметры:
//	УникальныйИдентификаторСтрокой 	- Строка
//	ТипОбъектаМетаданных 			- Строка
//	ИмяОбъектаМетаданных 			- Строка
//
// Возвращаемое значение:
//	Ссылка на документ/справочник или Неопределено
//
Функция СсылкаПоСтрокеУникальногоИдентификатора(УникальныйИдентификаторСтрокой, ТипОбъектаМетаданных, ИмяОбъектаМетаданных) Экспорт 
	
	Перем ИскомаяСсылка, Менеджер, УникальныйИдентификаторСсылки;
	
	Если НРег(ТипОбъектаМетаданных) = "справочник" Тогда
		Если Метаданные.Справочники.Найти(ИмяОбъектаМетаданных) = Неопределено Тогда
			Возврат Неопределено; 
		Иначе
			Менеджер = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени("Справочник." + ИмяОбъектаМетаданных);
		КонецЕсли;
	ИначеЕсли НРег(ТипОбъектаМетаданных) = "документ" Тогда
		Если Метаданные.Документы.Найти(ИмяОбъектаМетаданных) = Неопределено Тогда
			Возврат Неопределено;
		Иначе
			Менеджер = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени("Документ." + ИмяОбъектаМетаданных);
		КонецЕсли;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Если СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(УникальныйИдентификаторСтрокой) Тогда
		УникальныйИдентификаторСсылки = Новый УникальныйИдентификатор(УникальныйИдентификаторСтрокой);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	ИскомаяСсылка = Менеджер.ПолучитьСсылку(УникальныйИдентификаторСсылки);
	Если ОбщегоНазначения.СсылкаСуществует(ИскомаяСсылка) Тогда
		Возврат ИскомаяСсылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции // СсылкаПоСтрокеУникальногоИдентификатора

// Выполняет пропорциональное распределение суммы
//
// Параметры:
//  РаспределяемаяСумма  - Число - сумма, которую надо распределить; 
//	Таблица              - Таблица значений
//	ИмяКолонки           - Наименование колонки для заполнения
//	ИмяКолонкиБазы       - Наименование колонки базы распределения
//
Процедура РаспределитьСуммуПоКолонкеТаблицы(РаспределяемаяСумма, Таблица, ИмяКолонки, ИмяКолонкиБазы = "") Экспорт

	Если РаспределяемаяСумма <> 0 Тогда
		Если ПустаяСтрока(ИмяКолонкиБазы) Тогда
			МассивСтарыхСумм = Таблица.ВыгрузитьКолонку(ИмяКолонки);
		Иначе
			МассивСтарыхСумм = Таблица.ВыгрузитьКолонку(ИмяКолонкиБазы);
		КонецЕсли;
		МассивНовыхСумм = ККСНГ_ОбщегоНазначенияКлиентСервер.РаспределитьПропорционально(РаспределяемаяСумма, МассивСтарыхСумм);
		Если МассивНовыхСумм <> Неопределено Тогда
	 		Таблица.ЗагрузитьКолонку(МассивНовыхСумм, ИмяКолонки);
		КонецЕсли; 
	Иначе
		Таблица.ЗаполнитьЗначения(0, ИмяКолонки);
	КонецЕсли;

КонецПроцедуры

// Дополняет таблицу значений-приемник данными из таблицы значений-источник.
// Если таблица значений-приемник = Неопределено, то инициализирует ее таблицей значений-источником.
//
// Параметры:
//  ТаблицаИсточник - ТаблицаЗначений - таблица, из которой будут браться строки для заполнения;
//  ТаблицаПриемник - ТаблицаЗначений - таблица, в которую будут добавлены строки из таблицы-источника.
//  
Процедура ИнициализироватьДополнитьТаблицу(ТаблицаИсточник, ТаблицаПриемник) Экспорт
	
	Если ТаблицаПриемник = Неопределено Тогда
		ТаблицаПриемник = ТаблицаИсточник;
	Иначе
		ДополнитьТаблицу(ТаблицаИсточник, ТаблицаПриемник);
	КонецЕсли;		
		
КонецПроцедуры

// Дополняет таблицу значений-приемник данными из таблицы значений-источник.
//
// Параметры:
//  ТаблицаИсточник - ТаблицаЗначений - таблица, из которой будут браться строки для заполнения;
//  ТаблицаПриемник - ТаблицаЗначений - таблица, в которую будут добавлены строки из таблицы-источника.
//  
Процедура ДополнитьТаблицу(ТаблицаИсточник, ТаблицаПриемник) Экспорт
	
	Для Каждого СтрокаТаблицыИсточник Из ТаблицаИсточник Цикл
		
		ЗаполнитьЗначенияСвойств(ТаблицаПриемник.Добавить(), СтрокаТаблицыИсточник);
		
	КонецЦикла;
	
КонецПроцедуры

// Проверяет наличие и возвращает значение реквизита объекта
//
// Параметры:
//  Объект          - Произвольный объект
//	ИмяРеквизита    - Наименование реквизита объекта , возможно обращение через "."
//
// Возвращаемое значение:
// Неопределено или значение реквизита
// 
Функция ЗначениеИмеющегосяРеквизитаОбъекта(Объект, РеквизитыСтрокой) Экспорт
	
	Результат = Новый Соответствие;
	
	НаборРеквизитов = СтрРазделить(РеквизитыСтрокой, ",");
	
	Для каждого ИмяРеквизита Из НаборРеквизитов Цикл
		
		ИмяРеквизита = СокрЛП(ИмяРеквизита);
		
		МассивРеквизитов = СтрРазделить(ИмяРеквизита, ".");
		УровеньВложенности =  МассивРеквизитов.Количество();
		
		Если УровеньВложенности = 0 ИЛИ УровеньВложенности > 2 Тогда
			Продолжить;
		ИначеЕсли УровеньВложенности = 2 Тогда
			
			ТекущийРезультат = ЗначениеИмеющегосяРеквизитаОбъекта(Объект[МассивРеквизитов[0]], МассивРеквизитов[1]);
			ККСНГ_ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Результат, ТекущийРезультат);
			
		Иначе
			Если ЗначениеЗаполнено(Объект) И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, ИмяРеквизита) Тогда
				ЗначениеРеквизита = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект, ИмяРеквизита);
				Результат.Вставить(ИмяРеквизита, ЗначениеРеквизита);
			КонецЕсли;
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Преобразует строку таблицы значений в структуру.
// Свойства структуры и их значения совпадают с колонками переданной строки.
//
// Параметры:
//  СтрокаТаблицыЗначений - СтрокаТаблицыЗначений - строка таблицы значений.
//
// Возвращаемое значение:
//  Структура - преобразованная строка таблицы значений.
//
Функция СтрокаТаблицыЗначенийВСтруктуру(СтрокаТаблицыЗначений) Экспорт
	
	Структура = Новый Структура;
	Для каждого Колонка Из СтрокаТаблицыЗначений.Владелец().Колонки Цикл
		Структура.Вставить(Колонка.Имя, СтрокаТаблицыЗначений[Колонка.Имя]);
	КонецЦикла;
	
	Возврат Структура;
	
КонецФункции

// Возвращает параметр сеанса РаботаСВнешнимиРесурсамиЗаблокирована
//
// Параметры:
//	нет
//
// Возвращаемое значение:
//	Булево
//
Функция РаботаСВнешнимиРесурсамиЗаблокирована() Экспорт
	
	Попытка
		РаботаСВнешнимиРесурсамиЗаблокирована = Булево(ПараметрыСеанса.РаботаСВнешнимиРесурсамиЗаблокирована);
	Исключение
		РаботаСВнешнимиРесурсамиЗаблокирована = Ложь;
	КонецПопытки;
	
	Возврат РаботаСВнешнимиРесурсамиЗаблокирована; 
	
КонецФункции

// Возвращает ключ ФЗ загрузки документов
//
// Параметры:
//	нет
//
// Возвращаемое значение:
//	Строка
//
Функция КлючФоновогоЗаданияЗагрузкиДокументов() Экспорт
	
	Возврат "СФЕРАКурьерЗаписьДокументов";
	
КонецФункции

// Возвращает структуру папок для работы с документами
//
// Параметры:
//	нет
//
// Возвращаемое значение:
//	Соответствие
//
Функция ПапкиДокументов() Экспорт
	
	Папки = Новый Соответствие;
	Папки.Вставить("OnProcess", "На обработку");
	Папки.Вставить("Processed", "Обработанные");
	Папки.Вставить("In", "Входящие");
	Папки.Вставить("Out", "Исходящие");
	Папки.Вставить("Draft", "Черновики");
	Папки.Вставить("Favorites", "Избранное");
	Папки.Вставить("Trash", "Корзина");
	Папки.Вставить("NoRoute", "Документы без маршрутов");	
	
	Возврат Папки;
	
КонецФункции 

// Возвращает структуру папок для работы с документами кроме удаленных
//
// Параметры:
//	нет
//
// Возвращаемое значение:
//	Соответствие
//
Функция ПапкиДокументовДоступныеДляЗагрузки() Экспорт
	
	Папки = ПапкиДокументов();
	Папки.Удалить("Trash");
	Возврат Папки;
	
КонецФункции 

// Возвращает коды типов для структурированных документов
//
// Параметры:
//	нет
//
// Возвращаемое значение:
//	Массив
//
Функция ПолучитьКодыСтруктурированныхДокументов() Экспорт
	
	МассивКодов = Новый Массив;
	МассивКодов.Добавить("ACTFNS");
	МассивКодов.Добавить("INFSOOB");
	МассивКодов.Добавить("CSF");
	МассивКодов.Добавить("BILL");
	МассивКодов.Добавить("SF");
	МассивКодов.Добавить("WAYBILL");
	МассивКодов.Добавить("UO_DPINFSOOB");
	МассивКодов.Добавить("UPD_DOP");
	МассивКодов.Добавить("UPD_SF");
	МассивКодов.Добавить("UPD_SF_DOP");
	МассивКодов.Добавить("UCD_CSF");
	МассивКодов.Добавить("UCD_CSF_DIC");
	МассивКодов.Добавить("UCD_DIC");	
	МассивКодов.Добавить("TOVTORG");
	МассивКодов.Добавить("REZRU");
	МассивКодов.Добавить("UVHD_BILL");
	
	Возврат МассивКодов;
	
КонецФункции 

// Формирует массив вариантов обмена документами ДОП
//
// Параметры:
//  нет 
//
// Возвращаемое значение: 
//  Массив, тип элемента строка
//
Функция ВариантыНастройкиОбменаДОП() Экспорт
	
	Перем МассивВариантов, ИменаВариантовНастройки, ИмяВариантаНастройки;
	
	МассивВариантов = Новый Массив;
	
	ИменаВариантовНастройки  = ККСНГ_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьВариантыФорматовЭлектронныхДокументов();
	Для каждого ИмяВариантаНастройки Из ИменаВариантовНастройки Цикл
		Если СтрНайти(ИмяВариантаНастройки, "для каждого документа") > 0 Тогда
			МассивВариантов.Добавить(ИмяВариантаНастройки);
		КонецЕсли;
	КонецЦикла;
	
	// Дополним вариантами, реально настроенными по организацияи и контрагентам
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВложенныйЗапрос.ВариантНастройкиОбмена КАК ВариантНастройкиОбмена
	|ИЗ
	|	(ВЫБРАТЬ
	|		ККСНГ_Организации.ВариантНастройкиОбмена КАК ВариантНастройкиОбмена
	|	ИЗ
	|		Справочник.ККСНГ_Организации КАК ККСНГ_Организации
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ККСНГ_Контрагенты.ВариантНастройкиОбмена
	|	ИЗ
	|		Справочник.ККСНГ_Контрагенты КАК ККСНГ_Контрагенты) КАК ВложенныйЗапрос
	|ГДЕ
	|	ВложенныйЗапрос.ВариантНастройкиОбмена ПОДОБНО ""%для каждого документа%""";
	Запрос = Новый Запрос(ТекстЗапроса);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивВариантов.Добавить(Выборка.ВариантНастройкиОбмена);
	КонецЦикла;
	
	Возврат МассивВариантов;
	
КонецФункции

// Проверяет необходимость подписи2х сторон по коду титула
//
// Параметры:
//	КодТипаДокумента - Строка
//
// Возвращаемое значение:
//	Булево
//
Функция ТребуютсяПодписиДвухСторон(КодТипаДокумента) Экспорт
	
	Возврат КодТипаДокумента = "UpdSellerInfo"
		Или КодТипаДокумента = "UpdInvoiceSellerInfo"
		Или КодТипаДокумента = "Torg12SellerTitle"
		Или КодТипаДокумента = "UpdCorrectionSellerInfo"
		Или КодТипаДокумента = "UpdCorrectionInvoiceSellerInfo";		
	
КонецФункции

// Выводит информацию о статусе обработки при длительных операциях
//
// Параметры:
//  Информация     - Строка - Информация о текущей операции
//  КоличествоВсего	  - Число
//  Счетчик	          - Число
// 
Процедура СообщитьПрогрессЗагрузкиДокументов(КоличествоВсего, Счетчик, Информация) Экспорт
	
	ПроцентВыполнения = Цел((Счетчик) * 100 / КоличествоВсего);
	ДлительныеОперации.СообщитьПрогресс(ПроцентВыполнения, Информация, Счетчик);
	
КонецПроцедуры

// Проверяет, что в базе есть справочники, хранящие МЧД (МашиночитаемыеДоверенностиОрганизаций и МашиночитаемыеДоверенностиКонтрагентов)
// 
// Возвращаемое значение:
//  Булево - Истина, если в базе есть необходимые справочники
//
Функция ЕстьСправочникМашиночитаемыеДоверенности() Экспорт
	
	Перем Результат;
	Результат = (Метаданные.Справочники.Найти("МашиночитаемыеДоверенностиОрганизаций") <> Неопределено);
	
	Возврат Результат;
	
КонецФункции

#Область СериализацияXML

// Преобразует (сериализует) любое значение в XML-строку.
// Преобразованы в могут быть только те объекты, для которых в синтакс-помощнике указано, что они сериализуются.
// См. также ЗначениеИзСтрокиXML.
//
// Параметры:
//  Значение - Произвольный - значение, которое необходимо сериализовать в XML-строку.
//
// Возвращаемое значение:
//  Строка - XML-строка.
//
Функция ЗначениеВСтрокуXML(Значение) Экспорт
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, Значение, НазначениеТипаXML.Явное);
	
	Возврат ЗаписьXML.Закрыть();
КонецФункции

// Выполняет преобразование (десериализацию) XML-строки в значение.
// См. также ЗначениеВСтрокуXML.
//
// Параметры:
//  СтрокаXML - Строка - XML-строка, с сериализованным объектом..
//
// Возвращаемое значение:
//  Произвольный - значение, полученное из переданной XML-строки.
//
Функция ЗначениеИзСтрокиXML(СтрокаXML) Экспорт
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(СтрокаXML);
	
	Возврат СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ЭлектронныеПодписи

Функция ПолучитьЭлектронныеПодписиДокумента(ЭлектронныйДокумент)
	
	// проверить возможность работы с менеджером криптографии
	ДоступенМенеджерКриптографии = ДоступенМенеджерКриптографииНаСервере();
	
	МассивЭП = Новый Массив;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ККСНГ_ЭлектронныеДокументыDocumentSigns.Signed КАК ДатаПодписи,
	|	ККСНГ_СертификатыКлючейЭлектроннойПодписи.Подписант КАК Подписант,
	|	ККСНГ_СертификатыКлючейЭлектроннойПодписи.Organization КАК Организация,
	|	ККСНГ_СертификатыКлючейЭлектроннойПодписи.Title КАК Должность,
	|	ККСНГ_СертификатыКлючейЭлектроннойПодписи.Ссылка КАК Сертификат,
	|	ККСНГ_СертификатыКлючейЭлектроннойПодписи.Код КАК Отпечаток,
	|	ККСНГ_СертификатыКлючейЭлектроннойПодписи.Begin КАК НачалоДействия,
	|	ККСНГ_СертификатыКлючейЭлектроннойПодписи.End КАК КонецДействия,
	|	ККСНГ_ЭлектронныеДокументыDocumentSigns.Image КАК Подпись
	|ИЗ
	|	Справочник.ККСНГ_ЭлектронныеДокументы.DocumentSigns КАК ККСНГ_ЭлектронныеДокументыDocumentSigns
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ККСНГ_СертификатыКлючейЭлектроннойПодписи КАК ККСНГ_СертификатыКлючейЭлектроннойПодписи
	|		ПО ККСНГ_ЭлектронныеДокументыDocumentSigns.Сертификат = ККСНГ_СертификатыКлючейЭлектроннойПодписи.Ссылка
	|ГДЕ
	|	ККСНГ_ЭлектронныеДокументыDocumentSigns.Ссылка = &ЭлектронныйДокумент";
	Запрос.УстановитьПараметр("ЭлектронныйДокумент", ЭлектронныйДокумент);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтруктураЭП = ЗаполнитьСтруктуруОписанияЭлектроннойПодписи(Выборка, ДоступенМенеджерКриптографии, Истина);		
		МассивЭП.Добавить(СтруктураЭП);
	КонецЦикла;
	
	Возврат МассивЭП;
	
КонецФункции

Функция ПолучитьЭлектронныеПодписиПродавцаПокупателя(ЭлектронныйДокумент)
	
	// проверить возможность работы с менеджером криптографии
	ДоступенМенеджерКриптографии = ДоступенМенеджерКриптографииНаСервере();
	
	МассивЭП = Новый Массив;
	
	МассивТитулПокупателя = ККСНГ_ЭлектронныеДокументыВызовСервера.МассивТиповТранспортныхДокументовТитулПокупателя();
	
	// TODO получение данных подписи из квитанции
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ККСНГ_ЭлектронныеДокументыDocumentSigns.Signed КАК ДатаПодписи,
	|	ККСНГ_СертификатыКлючейЭлектроннойПодписи.Подписант КАК Подписант,
	|	ККСНГ_СертификатыКлючейЭлектроннойПодписи.Organization КАК Организация,
	|	ККСНГ_СертификатыКлючейЭлектроннойПодписи.Title КАК Должность,
	|	ККСНГ_СертификатыКлючейЭлектроннойПодписи.Ссылка КАК Сертификат,
	|	ККСНГ_СертификатыКлючейЭлектроннойПодписи.Код КАК Отпечаток,
	|	ККСНГ_СертификатыКлючейЭлектроннойПодписи.Begin КАК НачалоДействия,
	|	ККСНГ_СертификатыКлючейЭлектроннойПодписи.End КАК КонецДействия,
	|	ККСНГ_ЭлектронныеДокументыDocumentSigns.Image КАК Подпись,
	|	Истина КАК ЭтоЭД
	|ИЗ
	|	Справочник.ККСНГ_ЭлектронныеДокументы.DocumentSigns КАК ККСНГ_ЭлектронныеДокументыDocumentSigns
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ККСНГ_СертификатыКлючейЭлектроннойПодписи КАК ККСНГ_СертификатыКлючейЭлектроннойПодписи
	|		ПО ККСНГ_ЭлектронныеДокументыDocumentSigns.Сертификат = ККСНГ_СертификатыКлючейЭлектроннойПодписи.Ссылка
	|ГДЕ
	|	ККСНГ_ЭлектронныеДокументыDocumentSigns.Ссылка = &ЭлектронныйДокумент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ККСНГ_КвитанцииПодписи.ДатаПодписи,
	|	"""",
	|	"""",
	|	"""",
	|	NULL,
	|	"""",
	|	NULL,
	|	NULL,
	|	ККСНГ_КвитанцииПодписи.Content,
	|	Ложь
	|ИЗ
	|	Справочник.ККСНГ_Квитанции.Подписи КАК ККСНГ_КвитанцииПодписи
	|ГДЕ
	|	ККСНГ_КвитанцииПодписи.Ссылка.Владелец = &ЭлектронныйДокумент
	|	И ККСНГ_КвитанцииПодписи.Ссылка.Type В(&ТитулПокупателя)";
	Запрос.УстановитьПараметр("ЭлектронныйДокумент", ЭлектронныйДокумент);
	Запрос.УстановитьПараметр("ТитулПокупателя", МассивТитулПокупателя);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтруктураЭП = ЗаполнитьСтруктуруОписанияЭлектроннойПодписи(Выборка, ДоступенМенеджерКриптографии, Выборка.ЭтоЭД);		
		МассивЭП.Добавить(СтруктураЭП); 
	КонецЦикла;
	
	Возврат МассивЭП;
	
КонецФункции

// Служебная
Функция ЗаполнитьСтруктуруОписанияЭлектроннойПодписи(Выборка, ДоступенМенджереКриптографии, ДанныеПодписиЭД)
	
	СтруктураЭП = ПолучитьСтруктуруОписанияЭлектроннойПодписи();
	СтруктураЭП.ПрочитанСертификат = Ложь;
	ЗаполнитьЗначенияСвойств(СтруктураЭП, Выборка);
	Если ДанныеПодписиЭД Тогда
		СтруктураЭП.КомуВыданСертификат = Выборка.Подписант + ?(ЗначениеЗаполнено(Выборка.Организация), ", " + Выборка.Организация, "")
															+ ?(ЗначениеЗаполнено(Выборка.Должность), ", " + Выборка.Должность, "");
		// "С ... по ... " с форматной строкой "ДФ=dd.MM.yyyy";														
		СтруктураЭП.СрокДействия = ККСНГ_ЭлектроннаяПодписьКлиентСервер.СрокДействияСертификатаСтрокой(Выборка.НачалоДействия, Выборка.КонецДействия);
	КонецЕсли;
	
	ДвоичныеДанныеПодписи = Выборка.Подпись.Получить();
	СтруктураЭП.Подпись = ДвоичныеДанныеПодписи;
	
	Если ДоступенМенджереКриптографии Тогда
		ДанныеПодписи = ККСНГ_ОбщегоНазначенияВызовСервера.ПрочитатьДанныеПодписиНаСервере(ДвоичныеДанныеПодписи);
	КонецЕсли;
	
	Если ДанныеПодписи <> Неопределено Тогда
		Если ДанныеПодписиЭД Тогда
			СтруктураЭП.ИздательСертификата = ДанныеПодписи.ИздательСертификата;					
		Иначе
			ЗаполнитьЗначенияСвойств(СтруктураЭП, ДанныеПодписи);
		КонецЕсли;	
		СтруктураЭП.ПрочитанСертификат = Истина;
		СтруктураЭП.Подпись = Неопределено;		
	КонецЕсли;
	
	Возврат СтруктураЭП;
	
КонецФункции

// Служебная
Функция ПолучитьСтруктуруОписанияЭлектроннойПодписи()
	
	Возврат Новый Структура("ДатаПодписи, КомуВыданСертификат, Сертификат, Отпечаток, СрокДействия, ИздательСертификата, Подпись, ПрочитанСертификат");	
	
КонецФункции

// Служебная
Функция ДоступенМенеджерКриптографииНаСервере()
	
	МенеджерКриптографии = ЭлектроннаяПодпись.МенеджерКриптографии("ПолучениеСертификатов", Ложь);
	
	Возврат МенеджерКриптографии <> Неопределено;
	
КонецФункции

#КонецОбласти

Функция СтрокаСЧисломПоШаблону(ШаблонФорматирования, Количество)

	Окончание = СтрокаСЧислом(ШаблонФорматирования, Количество, ВидЧисловогоЗначения.Количественное, "L=ru");
	
	Результат = "" + Количество + " " + Окончание;
	
	Возврат Результат;

КонецФункции

#КонецОбласти
